#### 기술통계

    1. 데이터 개수 : len()
    2. 표본 평균 : mean()
    3. 표본 분산 : var()
    4. 표본 표준편차 : std()
    5. 최대값과 최소값 : max(), min()
    6. 중앙값 : median()
    7. 사분위수 : percentile( , 25) - 1사분위수 / percentile( , 75) - 3사분위수

##### 난수 발생과 카운팅

    1. 시드 설정하기
        - 컴퓨터가 정해진 알고리즘에 의해 난수처럼 보이는 수열을 생성함.
        - 이런 기준이 되는 시작 숫자를 시드라고 함.
        - np.random.seed(0) : 인수로는 0과 같거나 큰 정수를 넣어주면 됨.
    2. 데이터의 순서 바꾸기
        - np.random.shuffle() / 자체변환 함수로 한번 사용하면 변수의 값이 바뀜.
    3. 데이터 샘플링
        - 데이터 집합에서 일부를 무작위로 선택하는 것
        - np.random.choice(a, size=None, replace=True, p=None)
        - a : 배열이면 원래의 데이터, 정수이면, arange(a)로 데이터 생성
        - size : 정수(샘플 숫자)
        - replace : 불리언 / True이면 한번 선택한 데이터를 다시 선택 가능.
        - p : 배열 / 각 데이터가 선택될 수 있는 확률
    4. 난수 생성
        4.1. rand : 0부터 1사이의 균일 분포 / 여러개의 인수를 넣으면 해당 shape를 가진 행렬을 생성
        4.2. randn : 표준 정규 분포 / 기대값이 0이고 표준편차가 1
        4.3. randint : 균일 분포의 정수 난수 / np.random.randint(low, high=None, size=None)
            - high를 입력하지 않으면 0과 low 사이의 숫자, high를 입력하면 low와 high는 사이의 숫자를 출력
    5. 정수 데이터 카운팅
        5.1. unique() : 중복된 값을 제거하고 중복되지 않는 값의 리스트를 출력
            - return_counts 인수를 True로 설정하면 각 값의 데이터 개수를 리스트 형태로 출력 가능함.(데이터가 없는 경우 정보를 주지 않음)
        5.2. bincount() : 주사위를 던졌을 때 나오는 수처럼 특정 범위안의 수인 경우에 사용
            - minlength = ?를 사용하면 그 범위 내에 나올 수 있는 값에 대한 각 값의 데이터 개수를 출력함.

# Pandas(Panel Datas)
    
    * 개념
     1) 대부분의 데이터는 시계열이나 표(table)의 형태
     2) Series 클래스와 DataFrame 클래스를 제공
     3) 숫자 테이블과 시계열을 조작하기 위한 데이터 구조와 연산을 제공함.
    
    * Pandas package import
        import pandas as pd
    
    * Series class
     1) Numpy에서 제공하는 1차원 배열과 그 모양이 비슷함.
     2) 배열과 다르게 각 데이터의 의미를 표시하는 index를 붙일 수 있음.
     3) 데이터 자체는 값(value)라고 함.

     2. Series 생성하기
        2.1. Series 객체를 만들 때 첫 인수로 data, 두 번째 인수로는 index를 넣음.
        2.2. data 값으로 iterable, 배열, scalar value, dict(key와 index를 동일하게 사용하거나 생략)를 사용할 수 있음.
        2.3. index는 label이라고도 함. / index는 data와 length가 동일해야 함.
        2.4. label은 꼭 유일(unique)할 필요는 없음. / 다만 반드시 hashable type만 사용가능함.
        2.5. index를 생략할 경우 RangeIndex(0, 1, ..., n)를 제공함.
        2.6. Series의 인덱스는 인덱스 속성으로 접근할 수 있음. / Series의 value는 1차원 배열(ndarray)이며, values 속성으로 접근할 수 있음.
        2.7. Series 객체를 만들 때 data에 dict를 사용할 수 있음.
        2.8. data가 dict일 때 index가 최초에 dict의 key로 만들어지므로 최초의 index인 key와 재할당한 index가 다른 경우 NaN의 결과(값을 찾을 수 없음)를 출력
        2.9. 만약 label값이 영문 문자열인 경우에는 index label이 속성인것 처럼 마침표(.)를 활용하여 해당 index값에 접근할 수도 있음.
    
    3. Series의 특징
        3.1.Series 객체는 index label을 키(key)로 사용하기에 딕셔너리 자료형과 비슷한 특징을 갖음. - in 연산, items() 메서드, for문 루프 등
        3.2. Series도 벡터화 연상르 할수 있음. / 하지만 연산은 Series의 value에만 적용되며, index 값은 변하지 않는다.
        3.3. Series 인덱싱 : index label(문자)을 이용한 인덱싱도 가능함. / 배열 인덱싱을 하면 부분 값을 가지는 Series 자료형을 반환함.(순서를 바꾸거나 특정 자료만 선택할수있음)
        3.4. Series 슬라이싱 : 부분적인 Series를 반환하며, 숫자 인덱싱과 달리 콜론(:)기호 뒤에 오는 값도 결과에 포함됨.
        3.5. Series 데이터 추가, 갱신, 삭제 : add, update, delete

In [2]:
import pandas as pd

In [5]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯",
                    "여섯", "일곱", "여덟", "아홉", "열"],
                    index = [_ for _ in range(1, 11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [6]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
            index = ["서울", "부산", "인천", "대구"])
s       # column의 형태로 출력

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [7]:
s.name = "인구"         # Series 자체에 이름을 부여할 수있음.
s.index.name = "도시"   # index 자체에 이름을 부여할 수 있음.
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [12]:
# dict의 key와 Series 객체의 index가 다른 경우
d = {'a': 1, 'b': 2, 'c': 3}                        # dict로 data를 설정하게 되면 dict의 key값이 index로 적용
ser = pd.Series(data=d, index=['x', 'y', 'z'])      # index를 최초의 index인 key값과 다르게 할당하면 NaN(값을 찾을 수 없음)이 출력 됨.
ser                                                 # NaN 값이 float의 형태임.

x   NaN
y   NaN
z   NaN
dtype: float64

In [13]:
# index 지정없이 dict객체만 가지고 Series를 만들어 봄.
s2 = pd.Series({"서울":9_904_312,
                "부산":3_448_737,
                "인천":2_890_451,
                "대구":2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [15]:
# 2.9) index를 속성처럼 활용하기
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

ser.a, ser.b, ser.c

(1, 2, 3)

In [19]:
# 3.1) Series index와 딕셔너리 자료형
"서울" in s
for k,v in s. items():
    print(f"{k},{v}")

서울,9904312
부산,3448737
인천,2890451
대구,2466052

In [20]:
# Series의 벡터화 연산
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [22]:
# index lable(문자) 인덱싱
s[1],s["부산"]
s[3],s["대구"]

(2466052, 2466052)

In [24]:
# 배열 인덱싱
s[[0, 3, 1]]
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [27]:
# Series 슬라이싱
s[1:3]                  # [서울, 부산, 인천, 대구]에서 [부산, 인천]만 슬라이싱 하게 됨. 
s["부산":"대구"]          # [서울, 부산, 인천, 대구]에서 [부산, 인천, 대구]로 슬라이싱 하게 됨.

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [28]:
# 2010년도 인구자료
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [29]:
ds = s - s2     # key값과 서로 맞아야 계산이 됨.
ds              # NaN 값이 float 자료형에서만 표현가능하므로 모든 값이 float 자료형으로 출력됨.

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [31]:
ds.notnull()    # NaN값이 있는지 없는지 확인

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [32]:
ds[ds.notnull()]    # NaN인 값을 배제한 Series객체를 만들수 있음.

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [33]:
s # 2015년 도시별 인구
s2 # 2010년 도시별 인구

rs = (s - s2) / s2 * 100        # index 연산처리
rs =rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [34]:
# Series 데이터 갱신
rs["부산"] = 1.63       # index를 통해 값에 접근
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [36]:
# Series 데이터 추가
rs["대구"] = 1.41       # 없는 index에 값을 할당하면 Series에 데이터가 추가됨.
rs

부산        1.63
서울     2.83269
인천    9.818107
대구        1.41
dtype: object

In [37]:
# Series 데이터 삭제
del rs["서울"]
rs

부산        1.63
인천    9.818107
대구        1.41
dtype: object

In [46]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
fin2_value = [60200, 61200,200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(data=fin1)
ser_finance2 = pd.Series(data=fin2_value, index=fin2_index)
ser_finance1, ser_finance2

(카카오     60010
 삼성전자    61000
 LG전자    90000
 dtype: int64,
 카카오      60200
 삼성전자     61200
 네이버     200100
 dtype: int64)

In [61]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
fin2_value = [60200, 61200,200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, fin2_index)
print(ser_finance1)
print(ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64
카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [62]:
print(ser_finance1 - ser_finance2)     # LG전자와 네이버는 각 dict에 없는 값임. / NaN 값이 나오므로 float 형태로 출력
print(ser_finance1 + ser_finance2)
print(ser_finance1 * ser_finance2)
print(ser_finance1 / ser_finance2)

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64
LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [66]:
result = ser_finance1 - ser_finance2
result[result.notnull()]        # reusult.notnull()은 키값이 서로 있는 값을 True, 없으면 False로 나타내며, result[]가 True인 키값만 출력함.

삼성전자   -200.0
카카오    -190.0
dtype: float64

#### DataFrame class

    * 개념
     1) Pandas의 주요 데이터 구조
     2) label된 row와 column, 두개의 축을 갖는 데이터 구조
     3) 산술연산은 row와 column 모두 적용됨.
     4) Series 객체를 갖는 dictionary라고 생각하면 됨.
     5) 첫 인자로 data, 두 번째 인자로 index를 전달

    1. DataFrame 생성
        1.1. Series가 1차원 벡터 데이터에 행방향 index(row index)를 붙인 것 / DataFrame클래스는 2차원 행렬 데이터에 index를 붙인 것과 형태가 비슷.
        1.2. row와 column 각각 index를 가질 수 있음.
        1.3. DataFrame을 만드는 방법
            1.3.1. 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비
            1.3.2. 이 각각의 열에 대한 이름(label)을 키로 가지는 딕셔너리를 만듬.
            1.3.3. 이 데이터를 DataFrame 클래스 생성자에 넣는다. 동시에 열방향 index는 columns인수로, 행방향 index는 index인수로 지정함.
        1.4. DataFrame의 속성
            1.4.1. values : 열방향과 행방향 index는 각각 columns, index속성으로 접근함.
            1.4.2. 이름 붙이기 : 열방향(columns), 행방향(index)로 이름 붙이는 것도 가능
        1.5. DataFrame 전치(Transpose)
            - .T 를 통해 행과 열이 변환함.
        1.6. DataFrame column 추가, 갱신, 삭제
        1.7. DataFrame column 인덱싱
            1.7.1. columns index가 문자열 label일 때는 순서는 나타내는 정수 index를 column 인덱싱에 사용할 수 없음. 
            1.7.2. 문자열이 아닌 정수형 column index를 가지는 경우에는 index 값으로 정수를 사용할 수 있음.
        1.8. DataFrame row 슬라이싱
            1.8.1. row 단위로 인덱싱을 하고자 하면 항상 슬라이싱을 해야 함. / index의 값이 문자 label이면 label 슬라이싱도 가능.
        1.9. DataFrame 개별 데이터 인덱싱
            1.9.1. column label로 인덱싱하면 Series가 됨. -> 이 Series를 다시 row label로 인덱싱하면 개별 데이터가 나옴.
            1.9.2. 역순은? : row label로 인덱싱하면 KeyError가 발생 -> 우선 슬라이싱을 하면 DataFrame을 반환하는데 이 DataFrame을 다시 column label로 인덱싱하면 Series 객체가 나옴. (효율적이지 않아 사용하지 않는 것이 좋음)

In [68]:
d = {'co11': [1, 2], 'co12': [3, 4]}        # key값이 열방향 index, value가 행방향 index
df = pd.DataFrame(data=d)
df

   co11  co12
0     1     3
1     2     4

In [84]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [85]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [89]:
# 1.6) DataFrame 추가, 갱신, 삭제
df["2005-2010 증가율"] = df["2005-2010 증가율"] * 100
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
del df["2000"]
df

특성   지역     2015     2010     2005  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546         0.0283          -1.34
부산  경상권  3448737  3393191  3512547         0.0163          -3.40
인천  수도권  2890451  2632035  2517680         0.0982           4.54
대구  경상권  2466052  2431774  2456016         0.0141          -0.99

In [90]:
# 1.7) DataFrame 인덱싱  --> Series형태로 반환
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [91]:
# 1.7) DataFrame 인덱싱  --> DataFrame 타입이 반환
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [92]:
# 1.7) DataFrame column 인덱싱
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [93]:
# 1.7.1) DataFrame column 인덱싱 
# column 인덱스가 문자열일 때, 정수 인덱스로 접근할 수 없음.
df[0]

KeyError: 0

In [94]:
# 1.7.2) DataFrame column 인덱싱
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [96]:
# 1.7.2) DataFrame column 인덱싱
df2[2]
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

In [97]:
# 1.8.1) DataFrame row 슬라이싱
df      # index가 "서울"이자 0임.

특성   지역     2015     2010     2005  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546         0.0283          -1.34
부산  경상권  3448737  3393191  3512547         0.0163          -3.40
인천  수도권  2890451  2632035  2517680         0.0982           4.54
대구  경상권  2466052  2431774  2456016         0.0141          -0.99

In [98]:
# 1.8.1) DataFrame row 슬라이싱
df[:1]      # df[:"서울"] --> 문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546         0.0283          -1.34

In [ ]:
# 1.8.1) DataFrame row 슬라이싱
df[1:2]     # df["부산":"부산"]와 같다.

In [101]:
# DataFrame row 인덱싱
df["서울"]

KeyError: '서울'

In [103]:
# 1.9) DataFrame 개별 데이터 인덱싱
df["2015"]["서울"]
type(df["2015"]["서울"])

numpy.int64

In [75]:
data = {
    "경기수": [18, 18, 19, 18, 19, 20],
    "승점" : [47, 39, 38, 38, 33, 31],
    "승": [15, 12, 10, 12, 10, 9],
    "무": [2, 3, 8, 2, 3, 4],
    "패": [1, 3, 1, 4, 6, 7],
    "득실차": [28, 28, 22, 8, 10, 3]
}
columns = ["경기수", "승점", "승", "무", "패", "득실차"]
index = ["아스날", "맨시티", "뉴캐슬", "맨유", "토트넘", "풀럼"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     경기수  승점   승  무  패  득실차
아스날   18  47  15  2  1   28
맨시티   18  39  12  3  3   28
뉴캐슬   19  38  10  8  1   22
맨유    18  38  12  2  4    8
토트넘   19  33  10  3  6   10
풀럼    20  31   9  4  7    3

In [82]:
data = {
    "팀명": ['아스날', '맨시티', '뉴캐슬', '맨유', '토트넘', '뉴캐슬'],
    "경기수": [18, 18, 19, 18, 19, 20],
    "승점" : [47, 39, 38, 38, 33, 31],
    "승": [15, 12, 10, 12, 10, 9],
    "무": [2, 3, 8, 2, 3, 4],
    "패": [1, 3, 1, 4, 6, 7],
    "득실차": [28, 28, 22, 8, 10, 3]
}
columns = ["팀명", "경기수", "승점", "승", "무", "패", "득실차"]
index = [_ for _ in range(1,7)]
df = pd.DataFrame(data, index=index, columns=columns)
df.T

       1    2    3   4    5    6
팀명   아스날  맨시티  뉴캐슬  맨유  토트넘  뉴캐슬
경기수   18   18   19  18   19   20
승점    47   39   38  38   33   31
승     15   12   10  12   10    9
무      2    3    8   2    3    4
패      1    3    1   4    6    7
득실차   28   28   22   8   10    3

In [185]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [187]:
(1)
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [188]:
(2)
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [137]:
(3)
df["평균 점수"] = (df["국어"] + df["영어"] + df["수학"]) / 3
df

    국어  영어  수학      평균 점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [139]:
(4)
df["영어"]["방자"] = 80
df["평균 점수"] = (df["국어"] + df["영어"] + df["수학"]) / 3
df

/var/folders/cy/sw8s66dd02l8b9dj7pqk2ljm0000gn/T/ipykernel_90814/1692832483.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학      평균 점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [145]:
(5)
df[:1]

    국어  영어  수학      평균 점수
춘향  80  90  90  86.666667

In [177]:
(6)
h = pd.Series([df["국어"][2], df["영어"][2], df["수학"][2]],
                index =["국어", "영어", "수학"])
h

국어    70
영어    60
수학    80
dtype: int64

In [180]:
(6)
df_h = df.T
df_h["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [228]:
np.random.seed(0)

values = np.random.randn(6, 4)

dates = pd.date_range("20130226", periods=6)
dates

columns = ['A', 'B', 'C', 'D']
df = pd.DataFrame(values, index=dates, columns=columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

In [230]:
np.random.seed(0)

values = np.random.randn(6,4)
values

dates = pd.date_range("20130226", periods=6)
dates

df = pd.DataFrame(values, index=dates, columns=['A', 'B', 'C', 'D'])    # columns = list["ABCD"]
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

In [ ]:
np.random.seed(0)

values = np.random.randn(24)
values

dates = pd.date_range("20130226", periods=6)
dates

df = pd.DataFrame(values, index=dates, columns=['A', 'B', 'C', 'D'])
df

In [ ]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

"""
클래스 속성
count (default 0)
order (default 빈 리스트)

인스턴스 속성
number (필수)
name (default None)

비공개 인스턴스 속성
member (default 빈 set)

메서드
add_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 “000 님은 이미 팀에 있습니다.”를 출력하고 없으면 member에 추가하고 “000 님을 {self.number} 팀에 추가했습니다.” 출력합니다.
rm_member(): 이름을 인자로 받고 해당 이름이 member 요소로 있는 지 확인하고 있으면 member 요소에서 삭제하고 “000 님을 {self.number} 팀에서 삭제했습니다.” 출력합니다. 없으면 “000 님은 해당 팀에 없습니다.” 출력하고 메서드를 종료합니다.
get_count(), get_order()는 각각 count와 order의 값을 반환합니다.
set_order()는 숫자를 하나 인자로 받아와서 그 값을 order 맨 뒤에 추가합니다. 이때 이미 값이 있는 경우 앞의 값은 전부 지우고 맨 뒤에 값을 추가합니다.
"""

In [328]:

class Team():
    def __init__(self, number, count=0, order=[], member=set(), name=None):
        self.number = number
        self.count = count
        self.order = order
        self.name = name
        self.__member = member

    def number(self, number):
        self.number = number

    def add_member(self, name):
        if name in __member:
            print(f"{name} 님은 이미 팀에 있습니다.")
        else:
            __member.add(name)
            print(f"{self.add_member} 님을 {self.number} 팀에 추가했습니다.")

    def rv_member(self, rv_member):
        self.rv_member = rv_member
        if self.rv_member in rv_member:
            print(f"{self.rv_member} 님을 {self.number} 팀에서 삭제했습니다.")
        else:
            print(f"{self.rv_member} 님은 해당 팀에 없습니다.")
        return

    def __len__(self):
        return len(self.member)
    
    def get_count(self, count):
        return self.get_count
    
    def get_order(self, order):
        return self.get_order

In [329]:
t2 = Team(2)
t2.add_member("김민수")

TypeError: add_member() takes 1 positional argument but 2 were given

In [ ]:
class Team:
    """팀 객체를 만듭니다."""
    # 클래스 속성
    count = 0       # Team 클래스로부터 초기화된 인스턴스 개수
    order = []

    def __init__(self=t1, number, name=None, member=set()):
        # 인스턴스 속성
        self.number = number    # 팀번호
        self.name = name        # 팀이름
        self.__member = member
        Team.count += 1
    
    def add_member(self, name): # 멤버 개인의 이름
        # 해당 이름이 팀에 있을 경우
        if name in self.__member:
            print(f'{name} 님은 이미 팀에 있습니다.')
            return
        # 해당 이름이 팀에 없을 경우
        else:
            __member.add(name)
            print(f'{name} 님을 {self.number} 팀에 추가했습니다.')

    def rm_member(self, name):
        # 해당 이름이 팀에 있을 경우
        if name in self.__member:
            self.__member.discard(name)
            print(f'{name} 님을 {self.number} 팀에서 삭제했습니다.')
            return
        # 해당 이름이 팀에 없을 경우
        else:
            __member.rm(name)
            print(f'{name} 님을 해당 팀에 없습니다.')

    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self, number):
        if number in self.order:
            self.order.remove(number)
        self.order.append(number)

    # 내장 함수(bulit-in function) -> len(Team()) --> 파이썬이 __len__(self)를 찾아서 실행
    def __len__(self):
        return len(self.__member)

In [ ]:
t1 = Team()  # Team 클래스로부터 인스턴스를 초기화한다. 초기화할 때 넣는 인자 값은 __init__(self, 여기로 전달됨)
# 초기화될 때 1번이자 최초로 실행되는게 __init__(self)이 특별 메서드이다.